# Group By

In [1]:
import pandas as pd

In [2]:
var=pd.DataFrame({"Name":["a","b","c","a","b","b","c","a","b","c"],
                  "Sub1":[23,4,45,23,53,56,3,22,56,64],
                  "Sub2":[65,4,44,78,21,89,43,57,87,12]})
var

  Name  Sub1  Sub2
0    a    23    65
1    b     4     4
2    c    45    44
3    a    23    78
4    b    53    21
5    b    56    89
6    c     3    43
7    a    22    57
8    b    56    87
9    c    64    12

In [3]:
var1=var.groupby("Name")
var1

In [6]:
for x,y in var1:
    print(x)
    print(y)
    print("-"*20)

a
  Name  Sub1  Sub2
0    a    23    65
3    a    23    78
7    a    22    57
--------------------
b
  Name  Sub1  Sub2
1    b     4     4
4    b    53    21
5    b    56    89
8    b    56    87
--------------------
c
  Name  Sub1  Sub2
2    c    45    44
6    c     3    43
9    c    64    12
--------------------

In [7]:
var1.get_group("b")

  Name  Sub1  Sub2
1    b     4     4
4    b    53    21
5    b    56    89
8    b    56    87

In [8]:
var1.min()

      Sub1  Sub2
Name
a       22    57
b        4     4
c        3    12

In [9]:
var1.max()

      Sub1  Sub2
Name
a       23    78
b       56    89
c       64    44

In [10]:
var1.mean()

           Sub1       Sub2
Name
a     22.666667  66.666667
b     42.250000  50.250000
c     37.333333  33.000000

In [11]:
l=list(var1)
l

[('a',
    Name  Sub1  Sub2
  0    a    23    65
  3    a    23    78
  7    a    22    57),
 ('b',
    Name  Sub1  Sub2
  1    b     4     4
  4    b    53    21
  5    b    56    89
  8    b    56    87),
 ('c',
    Name  Sub1  Sub2
  2    c    45    44
  6    c     3    43
  9    c    64    12)]